# coding:utf-8
'''
#========================================================================
#   @Method:  获取bmc的信息
#   @Param:
#   @Return: host:带内访问bmc的IP地址 带[]
#========================================================================
'''

BMC_IP = 'FE80:0000:0000:0000:9E7D:A3FF:FE28:6FFA'
BMC_ETHNAME = 'veth'
BMC_PORT = 40443


def getinnerhost():
    '''
    #=====================================================================
    #   @Method:  获取带内bmc的IP地址函数
    #   @Param:
    #   @Return: host:带内访问bmc的IP地址 带[]
    #=====================================================================
    '''
    host = r'[%s%%%s]' % (BMC_IP, BMC_ETHNAME)
    return host


def getinnerport():
    '''
    #=====================================================================
    #   @Method:  获取带内bmc的端口号函数
    #   @Param:
    #   @Return: BMC_PORT:带内访问bmc的端口号
    #=====================================================================
    '''
    return BMC_PORT


def getinnerheaderhost():
    '''
    #=====================================================================
    #   @Method:  获取带内bmc的IP地址函数
    #   @Param:
    #   @Return: host:带内访问bmc的IP地址 不带[]
    #=====================================================================
    '''
    headerhost = r'%s%%%s' % (BMC_IP, BMC_ETHNAME)
    return headerhost
